Revit 2027 API
EntryAndSchemeConsistency Enumeration
 Enumeration used to specify why an entry is inconsistent with a scheme or another entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum EntryAndSchemeConsistency
Public Enumeration EntryAndSchemeConsistency
public enum class EntryAndSchemeConsistency
type EntryAndSchemeConsistency
Members
Member name | Value | Description
Consistent | 0 |  The scheme entry can be applied to the scheme.
InconsistentStorageType | 1 |  The type of value stored in the entry is different from the type of the scheme parameter.
InvalidFillPatternId | 4 |  The fill pattern id is not valid.
ValueDuplicated | 3 |  There already exists another entry with the same value.
ValueOutOfRange | 2 |  The value stored in the entry is out of the scheme parameter range.
See Also
Reference
Autodesk.Revit.DB Namespace